БухЭксп/Catalogs/ТорговыеПредложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТорговыеПредложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяСуммаЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьОстаткиИЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговоеПредложениеРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПредложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/ТоварыТорговыхПредложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТоварыТорговыхПредложений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НетВПрайсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговоеПредложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПредложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/ТорговыеПредложения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ПриСозданииЧтенииНаСервере();
	
	ИспользуетсяНесколькоОрганизацийЭД = Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
	
	Если ЗначениеЗаполнено(Объект.Организация) И Не ИспользуетсяНесколькоОрганизацийЭД Тогда
		
		Элементы.Организация.Видимость = Ложь;
		
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие.ТорговыеПредложения
	Если Объект.Ссылка.Пустая() Тогда
		ОбновитьДанныеПубликацииТорговыхПредложений();
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения
	
	ПрочитатьТоварыТорговогоПредложения();
	
	ПрочитатьНастройкиПубликации(Объект.Ссылка);
	
	ПоВсемКонтрагентам = Истина;
	
	
	СхемаВыгрузкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаВыгрузки");
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиДанных, УникальныйИдентификатор);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаВыгрузкиДанных.НастройкиПоУмолчанию);
	
	Элементы.СрокПоставки.Доступность              = НЕ ТолькоПросмотр;
	Элементы.ДекорацияВидЦены.Доступность          = НЕ ТолькоПросмотр;
	Элементы.МинимальнаяСуммаЗаказа.Доступность    = НЕ ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ЭлектронноеВзаимодействие.ТорговыеПредложения
	Если ИмяСобытия = "ТорговыеПредложения_ИзменениеСинхронизации"
		И (Параметр = Неопределено ИЛИ Параметр = Объект.Ссылка) Тогда
		
		ОбновитьДанныеПубликацииТорговыхПредложений();
		
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения
	
	Если ИмяСобытия = "ТорговыеПредложения_ЗаписьДополнительныеНастройки"
		И Параметр.ТорговоеПредложение = Объект.Ссылка Тогда
		
		НастроитьФормуПослеИзмененияНастроекПубликации(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ТекущийОбъект.Ссылка.Пустая());
	
	ПроверкаНаДубли = ЭтотОбъект.Товары.Выгрузить(,"Номенклатура, ЕдиницаИзмерения");
	ПроверкаНаДубли.Колонки.Добавить("Количество");
	ПроверкаНаДубли.ЗаполнитьЗначения(1,"Количество");
	ПроверкаНаДубли.Свернуть("Номенклатура, ЕдиницаИзмерения","Количество");
	
	Шаблон = НСтр("ru = 'По товару %1 в табличной части найдено %2'");
	
	Для Каждого СтрокаПроверки Из ПроверкаНаДубли Цикл
		
		Если СтрокаПроверки.Количество > 1 Тогда
			Отказ = Истина;
			
			Строк = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';%1 строка;;%1 строки;%1 строк;%1 строки'"),
				СтрокаПроверки.Количество);
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(Шаблон, СтрокаПроверки.Номенклатура, Строк);
			Сообщение.Поле = "Товары";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущийОбъект.ТорговоеПредложениеРодитель = Справочники.ТорговыеПредложения.ПустаяСсылка();
	
	ТекущийОбъект.ПоВсемТоварам = Товары.Количество() = 0;
	
	// ЭлектронноеВзаимодействие.ТорговыеПредложения
	ТорговыеПредложения.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, Объект.Организация, Элементы.ГруппаУправленияТорговымиПредложениями, Отказ);
	// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// ЭлектронноеВзаимодействие.ТорговыеПредложения
	ТорговыеПредложенияКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьЗаголовокВидыЦен();
	СформироватьЗаголовокСрокПоставки();
	СформироватьПредставлениеМинимальнойСуммыЗаказа();
	УстановитьВидимостьГруппыТовары();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ЭлектронноеВзаимодействие.ТорговыеПредложения
	ТорговыеПредложения.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, Объект.Организация, Элементы.ГруппаУправленияТорговымиПредложениями);
	// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЭтотОбъект.Модифицированность 
		И НЕ ТекущийОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ТоварыТорговыхПредложений");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ТорговоеПредложение", ТекущийОбъект.Ссылка);
		БлокировкаДанных.Заблокировать();
		
		НаборТоваров = РегистрыСведений.ТоварыТорговыхПредложений.СоздатьНаборЗаписей();
		НаборТоваров.Отбор.ТорговоеПредложение.Установить(ТекущийОбъект.Ссылка);
		
		ТаблицаТоваров = ЭтотОбъект.Товары.Выгрузить();
		ТаблицаТоваров.Колонки.Добавить("ТорговоеПредложение");
		ТаблицаТоваров.ЗаполнитьЗначения(ТекущийОбъект.Ссылка, "ТорговоеПредложение");
		
		Если НЕ Объект.ОбновлятьОстаткиИЦены Тогда
			ТаблицаТоваров.ЗаполнитьЗначения(Ложь, "НетВПрайсе");
			ЭтотОбъект.Товары.Загрузить(ТаблицаТоваров);
		КонецЕсли;
		
		НаборТоваров.Загрузить(ТаблицаТоваров);
		НаборТоваров.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Информация = ИнформацияОбОшибке();
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Сохранение торгового предложения'"),
			ПодробноеПредставлениеОшибки(Информация), НСтр("ru = 'Не удалось сохранить торговое предложение'"), "",
			ТекущийОбъект.Ссылка);
			
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ЭлектронноеВзаимодействие.ТорговыеПредложения
	ОбновитьДанныеПубликацииТорговыхПредложений();
	// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаТовар Из Товары Цикл
		
		НомерСтроки = Товары.Индекс(СтрокаТовар);
		
		Если ЦеныПубликуются
			И СтрокаТовар.Цена = 0
			И НЕ (Объект.ОбновлятьОстаткиИЦены И СтрокаТовар.НетВПрайсе) Тогда
			
			ТекстОшибки = Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'В строке %1 не заполнена цена.'"), НомерСтроки+1)
				+Символы.ПС
				+НСтр("ru = 'Для торгового предложения включена публикация цен на товары'"));
				
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки, 
				Объект.Ссылка, 
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", НомерСтроки, "Цена"), , Отказ);
				
		КонецЕсли;
			
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.ТипЦены) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Вид цены не выбран'"), 
			Объект.Ссылка , "ДекорацияВидЦены",, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДействия) 
		И Объект.ДатаОкончанияДействия < Объект.ДатаНачалаДействия Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Дата окончание периода не может быть меньше даты начала'"),
			Объект.Ссылка, "ДатаОкончанияДействия", , Отказ);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияВидЦеныНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Ключ" , Объект.ТипЦены);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе" , Истина);
	
	ОткрытьФорму("Справочник.ТипыЦенНоменклатуры.ФормаВыбора",
	    ПараметрыОткрытия,
	    УникальныйИдентификатор,
	    ,,,
	    Новый ОписаниеОповещения("ВыборВидаЦен_Завершение",ЭтотОбъект),
	    РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияПЛОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СрокПоставкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("СрокПоставкиЗавершение",ЭтотОбъект);
	
	ПоказатьВводЧисла(Оповещение, Объект.СрокПоставки,
	    НСтр("ru = 'Введите срок поставки'"),
	    3,
	    0);
	    
КонецПроцедуры

&НаКлиенте
Процедура МинимальнаяСуммаЗаказаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("МинимальнаяСуммаЗаказаЗавершение", ЭтотОбъект);
	
	ПоказатьВводЧисла(Оповещение, Объект.МинимальнаяСуммаЗаказа,
		НСтр("ru = 'Введите минимальную суму заказа'"), 15, 2);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ПересчетНомераСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ПересчетНомераСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	РеквизитыНоменклатуры = РеквизитыНоменклатуры(ТекущиеДанные.Номенклатура, "ЕдиницаИзмерения");
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, РеквизитыНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда 
		Элементы.Товары.ТекущиеДанные.НетВПрайсе = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока Тогда
		Элементы.Товары.ТекущиеДанные.НомерСтроки = Товары.Количество();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ЭлектронноеВзаимодействие.ТорговыеПредложения
&НаКлиенте
Процедура Подключаемый_ПриИзменении_ПубликоватьТорговыеПредложения (Элемент, СтандартнаяОбработка)
	
	ТорговыеПредложенияКлиент.ПриИзмененииПубликоватьТорговыеПредложения(ЭтотОбъект, Объект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОценку(Команда)
	
	СписокВариантов = Элементы.ТоварыОценка.СписокВыбора;
	
	Описание = Новый ОписаниеОповещения("УстановкаОценки_Завершение",ЭтотОбъект);
	
	СписокВариантов.ПоказатьВыборЭлемента(Описание, НСтр("ru = 'Выберите оценку остатка'"));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Нажатие_ГиперссылкиТорговыхПредложений(Элемент, СтандартнаяОбработка)
	
	ТорговыеПредложенияКлиент.ТорговыеПредложенияНажатиеГиперссылки(ЭтотОбъект, Объект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУсловию(Команда)
	
	Если Товары.Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоУсловию_Завершение", ЭтотОбъект),
		               НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'"),
		               РежимДиалогаВопрос.ДаНет,,
		               КодВозвратаДиалога.Да,);
		
		Возврат;
	
	КонецЕсли;
	
	ЗаполнитьПоУсловию_Завершение(КодВозвратаДиалога.Да,Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоШтрихКоду(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьПоШтрихкодуПослеПоиска", ЭтотОбъект, Неопределено);
	ШтрихкодированиеНоменклатурыБПКлиент.ПоказатьВводШтрихкода(Оповещение); 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦену"            , Истина);
	ПараметрыФормы.Вставить("ЗагружатьКоличество"      , Истина);
	ПараметрыФормы.Вставить("ЗагружатьОценку"          , Истина);
	ПараметрыФормы.Вставить("ЗагружатьЕдиницыИзмерения", Истина);
	
	Описание = Новый ОписаниеОповещения("Подключаемый_ЗагрузитьИзВнешнегоФайла_Завершение",ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма", 
	    ПараметрыФормы,
	    ,,,,
	    Описание);
	    
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦенуНаПроцент(Команда)
	
	ПараметрыФормы = Новый Структура();
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьЦенуНаПроцент_Завершение",ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ТорговыеПредложения.Форма.ФормаВыбораПроцента", 
	    ПараметрыФормы,
	    ЭтотОбъект.УникальныйИдентификатор,
	    ,,,
	    Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  
	
&НаКлиенте
Процедура ОбновитьПоДаннымПрайсЛиста(Команда)
	ОбновитьПоДаннымПрайсЛистаНаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПослеИзмененияНастроекПубликации(Параметр)
	
	ЦеныПубликуются = Параметр.ПубликоватьЦены;
	
	ВариантыПубликацииКоличества = Новый Массив;
	
	ВариантыПубликацииКоличества.Добавить(Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.Количество);
	ВариантыПубликацииКоличества.Добавить(Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.КоличествоИНаличие);
	
	ВариантыПубликацииОценки = Новый Массив;
	
	ВариантыПубликацииОценки.Добавить(Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.Наличие);
	ВариантыПубликацииОценки.Добавить(Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.КоличествоИНаличие);
	ВариантыПубликацииОценки.Добавить(Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.ПустаяСсылка());
	
	Элементы.ТоварыКоличество.Видимость = 
		(Параметр.ПубликоватьОстатки
			И ВариантыПубликацииКоличества.Найти(Параметр.ВариантПубликацииОстатков) <> Неопределено);
			
	Элементы.ТоварыОценка.Видимость =
		(Параметр.ПубликоватьОстатки 
			И ВариантыПубликацииОценки.Найти(Параметр.ВариантПубликацииОстатков) <> Неопределено);
			
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	Ответ = ПолучитьРеквизитыВидаЦен(Объект.ТипЦены);
	
	Если Ответ = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Валюта = Ответ.ВалютаЦены;
	ЦенаВключаетНДС = Ответ.ЦенаВключаетНДС;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыОценка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Оценка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -1;

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'По запросу'"));

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыОценка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Оценка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Мало'"));
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыОценка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Оценка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Достаточно'"));
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыОценка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Оценка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Много'"));

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыОценка.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Оценка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 3;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиПубликации(ТорговоеПредложение)
	
	НастройкиПубликации = ТорговыеПредложения.НастройкиПубликации(ТорговоеПредложение);
	
	Если НастройкиПубликации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПослеИзмененияНастроекПубликации(НастройкиПубликации);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчетНомераСтрок(Форма)

	НомерСтроки = 0;
	
	Для Каждого Товар Из Форма.Товары Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Товар.НомерСтроки = НомерСтроки
		
	КонецЦикла;


КонецПроцедуры

// ЭлектронноеВзаимодействие.ТорговыеПредложения
&НаСервере
Процедура ОбновитьДанныеПубликацииТорговыхПредложений()
	
	ТорговыеПредложения.ИнициализацияЭлементовФормы(ЭтотОбъект, Элементы.ГруппаУправленияТорговымиПредложениями);
	
КонецПроцедуры
// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения

&НаСервере
Процедура ПрочитатьТоварыТорговогоПредложения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыТорговыхПредложений.Номенклатура КАК Номенклатура,
		|	ТоварыТорговыхПредложений.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТоварыТорговыхПредложений.НетВПрайсе КАК НетВПрайсе,
		|	ТоварыТорговыхПредложений.Количество КАК Количество,
		|	ТоварыТорговыхПредложений.Оценка КАК Оценка,
		|	ТоварыТорговыхПредложений.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ТоварыТорговыхПредложений КАК ТоварыТорговыхПредложений
		|ГДЕ
		|	ТоварыТорговыхПредложений.ТорговоеПредложение = &ТорговоеПредложение";
	
	Запрос.УстановитьПараметр("ТорговоеПредложение", Объект.Ссылка);
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ПересчетНомераСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыВидаЦен(ВидЦены)
	
	Если НЕ ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ответ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидЦены, "ВалютаЦены, ЦенаВключаетНДС");
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура ВыборВидаЦен_Завершение(Результат, ДопПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		Ответ = ПолучитьРеквизитыВидаЦен(Результат);
		
		Если Ответ = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Объект.ТипЦены = Результат;
		Валюта = Ответ.ВалютаЦены;
		ЦенаВключаетНДС = Ответ.ЦенаВключаетНДС;
		
		СформироватьЗаголовокВидыЦен();
		СформироватьПредставлениеМинимальнойСуммыЗаказа();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокВидыЦен()
	
	ЦенаВключаетНДСТекст = ?(ЦенаВключаетНДС, НСтр("ru = 'НДС в сумме'"), НСтр("ru = 'НДС сверху'"));
	
	МассивСтрок = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ТипЦены) Тогда
		МассивСтрок.Добавить(Строка(Объект.ТипЦены));
	Иначе 
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '<Тип цены не выбран>'"), , WebЦвета.Красный));
	КонецЕсли;
	
	МассивСтрок.Добавить(" (");
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		МассивСтрок.Добавить(Строка(Валюта));
	Иначе
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '<Валюта не выбрана>'"),,WebЦвета.Красный));
	КонецЕсли;
	
	МассивСтрок.Добавить(") • ");
	
	МассивСтрок.Добавить(ЦенаВключаетНДСТекст);
	
	Элементы.ДекорацияВидЦены.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеМинимальнойСуммыЗаказа()
	
	Если ЗначениеЗаполнено(Объект.МинимальнаяСуммаЗаказа) Тогда
		МинимальнаяСуммаЗаказаПредставление = СтрШаблон("%1 %2", Формат(Объект.МинимальнаяСуммаЗаказа, "ЧДЦ=2"), Строка(Валюта));
	Иначе
		МинимальнаяСуммаЗаказаПредставление = НСтр("ru = 'Любая'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокСрокПоставки()

	Если Объект.СрокПоставки = 0 Тогда
		
		СрокПоставки = НСтр("ru = 'В наличии'");
		
	Иначе
		
		СрокПоставки = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		        НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня'"),
		        Объект.СрокПоставки);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГруппыТовары()
	
	
КонецПроцедуры

&НаКлиенте
Процедура СрокПоставкиЗавершение(Число,ДополнительныеПараметры) Экспорт
	
	Если Число <> Неопределено Тогда 
			Объект.СрокПоставки = Число;
	КонецЕсли;
	
	СформироватьЗаголовокСрокПоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура МинимальнаяСуммаЗаказаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.МинимальнаяСуммаЗаказа = Результат;
	
	СформироватьПредставлениеМинимальнойСуммыЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУсловию_Завершение(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда 
		ОткрытьФорму("Справочник.ТорговыеПредложения.Форма.ФормаВыбораНоменклатуры",
			Новый Структура("Настройки",КомпоновщикНастроек.Настройки),
			ЭтотОбъект.УникальныйИдентификатор,
			,,,
			Новый ОписаниеОповещения("ПриЗакрытииФормыВыбранныхОбъектов",ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбранныхОбъектов(Настройки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		ЗаполнитьТоварыОтбора();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыОтбора()

	Товары.Очистить();
	СхемаКомпоновки = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаВыгрузки");
	
	ТаблицаДанныеПакетаПредложений = Новый ТаблицаЗначений;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, КомпоновщикНастроек.Настройки,,,
	           Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанныеПакетаПредложений);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Товары.Загрузить(ТаблицаДанныеПакетаПредложений);
	
	НомерСтроки = 0;
	
	Для Каждого Товар Из Товары Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Товар.НомерСтроки = НомерСтроки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыНоменклатуры(Знач СсылкаНаОбъект, Знач Реквизиты);
	Возврат ТорговыеПредложенияБП.РеквизитыНоменклатурыПриИзменении(СсылкаНаОбъект, Реквизиты);
КонецФункции

&НаКлиенте
Процедура ДобавитьПоШтрихкодуПослеПоиска(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Штрихкоды = Результат;
	Иначе
		Штрихкоды = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Результат);
	КонецЕсли;
	
	Для каждого ТекущийШтрихкод Из Штрихкоды Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийШтрихкод);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыНоменклатуры(НоваяСтрока.Номенклатура, "ЕдиницаИзмерения"));
		НоваяСтрока.НомерСтроки = Товары.Количество();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьИзВнешнегоФайла_Завершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Товары.Очистить();
		
		НомерСтроки = 0;
		Для Каждого СтрокаРезультата Из Результат Цикл
			
			НомерСтроки = НомерСтроки + 1;
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
			НоваяСтрока.НомерСтроки = НомерСтроки;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОценки_Завершение(Значение,ДополнительныеПараметры) Экспорт
	
	Если Значение<>Неопределено Тогда
		
		Для Каждого Индекс Из Элементы.Товары.ВыделенныеСтроки	Цикл 
			Элементы.Товары.ДанныеСтроки(Индекс).Оценка=Значение.Значение;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦенуНаПроцент_Завершение(РезультатВыполнения,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыполнения) Тогда
		
		Для Каждого Индекс Из Элементы.Товары.ВыделенныеСтроки Цикл
			
			СтрокаТаблицы = Элементы.Товары.ДанныеСтроки(Индекс);
			
			СуммаПроцента = РезультатВыполнения.Процент * СтрокаТаблицы.Цена/100;
					
			Если РезультатВыполнения.Уменьшить Тогда
				СтрокаТаблицы.Цена = СтрокаТаблицы.Цена - СуммаПроцента;
			Иначе 
				СтрокаТаблицы.Цена = СтрокаТаблицы.Цена + СуммаПроцента;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьПоДаннымПрайсЛистаНаСервере()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ТипЦены", Объект.ТипЦены);
	Запрос.УстановитьПараметр("Валюта",  Валюта);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			ТипЦен = &ТипЦены
	|				И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена <> 0";
	
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Товары.Загрузить(ТаблицаНоменклатуры);
КонецПроцедуры 

#КонецОбласти
